[
	{
		"company": "Ableton",
		"link": "https://ableton.com",
		"role": "Frontend Engineer",
		"timeframe": "2021 - Present",
		"description": "<p>At Ableton I was part of the Ableton.com Team inside the Customer Experience Unit, which focuses on developing and improving product tours, blog articles, learning materials and many other parts of the ableton.com website.</p><p> I was also an active member of the Web Accessibility Working Group, which works on improving the accessibility of the website and domain.",
		"projects": [
			{
				"name": "Ableton.com",
				"link": "https://ableton.com",
				"description": "<p>Release of the product tours for Ableton Note, Ableton Push 3 and Ableton Live 12.</p><p>Constant improvement of pages and components in several places, with a focus on usability and accessibility.</p><p>Creation, maintaining and documentation of new WebComponents inside the design system.</p><p>Refactoring of Django HTML Templates into WebComponents, transformation of legacy Javascript function into OOP Classes and SASS legacy styles into SCSS utility classes and BEM blocks. </p><p>Integration of features using TTD in Python.</p><p>Implementation of NPS Survey components into Emarsys with communication to Zendesk.<p></p> Conception and implementation of AB test scenarios.</p><p>Support and integration of a domain wide Accessibility Audit with an external agency.</p>"
			}
		]
	},
	{
		"company": "CDLX",
		"link": "https://cdlx.de",
		"role": "Fullstack Developer",
		"timeframe": "2019 - 2021",
		"description": "My job in CDLX included the development and exchange of ideas for digital products and services. That gave me the opportunity to work closely with designers and clients to produce high quality websites and configurators.",
		"projects": [
			{
				"name": "The New Insitute",
				"link": "https://thenew.institute/",
				"description": "Implementation of the Layout concept and development of multiple components as well as the parts of the main navigation."
			},
			{
				"name": "Stiftung Kunstfonds",
				"link": "https://www.kunstfonds.de/",
				"description": "Development of the website, including the implementation of the UI/UX principles. Creation of an API to search, sort, and filter art pieces from their catalog."
			},
			{
				"name": "University of Bielefeld",
				"link": "https://www.uni-bielefeld.de/",
				"description": "Creation of templates and styling for the integration into Roxen with maintainance, extensions and long term client support with high focus on accessibility."
			},
			{
				"name": "Hans Grohe ",
				"link": "",
				"description": "Creating reusable Angular components for an internal research app in connection with REST API for PIM and asset management. Close cooperation with agile workflow including dailies, refinements, plannings & review/retros."
			},
			{
				"name": "Isipedia Climate Institute, Potsdam",
				"link": "",
				"description": "I participated in the creation of the website and the Frontend part for the configurator which allow scientist to climate-impacts assessments reports. (*<a href=\"https://www.ddc.de/de/wettbewerb/gute-gestaltung-2019/interactive/isipedia-the-open-climate-impacts-encyclopedia.php\" target=\"_blank\">DDC award</a>)"
			},
			{
				"name": "VG Bildkunst & Bund Bildender Künstler",
				"link": "",
				"description": "Frontend implementation of an internal form generator application to submit a request for membership."
			},
			{
				"name": "Selux",
				"link": "https://www.selux.com/configurators/int/de/TheLine",
				"description": "Development of a configurator for the Line product series."
			},
			{
				"name": "Selux",
				"link": "https://www.selux.com/lookbook/aira-de_ger/",
				"description": "Planning and execution of a lightning concept for product photo shooting of the Aria line. "
			}
		]
	},
	{
		"company": "CDLX",
		"link": "https://cdlx.de",
		"role": "Junior Frontend Developer",
		"timeframe": "2017 - 2019",
		"description": "<p>* If not further specified, projects were developed in PHP with customized Kirby CMS, HTML, Javascript, SCSS using BEM structure & GIT for distribution.</p>",
		"projects": [
			{
				"name": "Weizenbaum Institute",
				"link": "https://www.weizenbaum-institut.de/",
				"description": "Maintainance and creation of templates for implementation into Typo3. Implementation of the publication search section in connection with the Zotero API. "
			},
			{
				"name": "Land der Ideen",
				"link": "https://land-der-ideen.de/",
				"description": "Implementation and maintenance of components for campaigns."
			},
			{
				"name": "Waald",
				"link": "https://waald.com/",
				"description": "Implementation of the layout concept and development of the website."
			},
			{
				"name": "Bundesverband der Deutschen Industrie e.V.",
				"link": "https://bdi.eu/",
				"description": ""
			},
			{
				"name": "Galerie Nordenhake",
				"link": "https://nordenhake.com/",
				"description": ""
			},
			{
				"name": "Diculta",
				"link": "http://diculta.com/",
				"description": ""
			}
		]
	}
]